#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<limits.h>

//如何在不使用第三个变量的情况，交换两个整数的值
int main0601()
{
	int a = 3;
	int b = 5;
	
	a = a + b;
	b = a - b;
	a = a - b;
	printf("a=%d b=%d\n", a, b);
	//这个代码有什么问题？？?
	//整型溢出 int  4Byte  32bit
	//用以下方法(类型_MAX或MIN)查看整型的最大值或最小值（查看方法，转到定义）；所在头文件<limits.h>
	INT_MAX;// 2147483647 
	INT_MIN;//-2147483647 - 1
	
	return 0;
}



//注意这里是第二种写法，但是可读性差
//在此之前先观察以下
//先观察
	/*
	3^3   011^011  =0
	5^5   101^101  =0
	a^a   =0
	... ...
	*/

	/*
	0^5    000^101 =101=5
	0^3    000^011 =011=3
	0^a    =a
	... ...
	*/

	/*
	3^5^3  011^101^011 = 110^011 = 101=5
	3^3^5  011^011^101 = 000^101 = 101=5
	从这里可以看出异或是满足交换律的
	*/
int main0602(void)
{
	int a = 3;
	int b = 5;

	a = a ^ b; //011^101=110
	b = a ^ b; //110^101=011  a^b^b得到a赋值给b
	a = a ^ b; //110^011=101  a^b^a^b^b得到b赋值给a
	//a原来的值011对应现在b的值；b原来的值101对应现在a的值
	printf("a=%d b=%d\n", a, b);
}

