#include<stdio.h>

int main0501()
{
	int arr[] = { 5,3,1,2,4,9,6,7,8,10 };
	//arr = 100;
	//数组名是一个常量，不允许被赋值

	printf("%p\n", arr);
	printf("%p\n", &arr[0]);
	//证明了数组名是首元素地址
	return 0;
}


int main0502(void)
{
	//数组名是首元素地址有两个例外(也就是说在有这两个例外的情况下,数组名不是首元素地址)
	int arr[] = { 5,3,1,2,4,9,6,7,8,10 };
	int sz = sizeof(arr) / sizeof(arr[0]);
	//1.sizeof(数组名)此时计算的是整个数组的大小,单位是字节

	printf("%p\n", arr);
	printf("%p\n", &arr[0]);
	printf("%p\n\n", &arr);
	//发现都是一样的地址;这时可能会想取地址arr也是数组首元素地址???  但其实是数组的地址	
	printf("%p\n", arr+1);
	printf("%p\n", &arr[0]+1);
	printf("%p\n", &arr+1);
	//打印结果
	    //183D8FC38
		//183D8FC38
		//183D8FC38

		//183D8FC3C
		//183D8FC3C
		//183D8FC60
	//发现是首元素地址的+1就是第二个元素;而数组的地址+1(c38--c60里刚好40个字节)
	//到这里是想说明&arr拿到的是整个数组的地址(数组地址和数组首元素地址从值上看一样,但是意义不一样)
	//2.&(数组名)此时取出的是整个数组的地址

	return 0;
}