#include<stdio.h>

int main0201(void)
{
	//算术操作符 +  -  *  /  %(取模)
	//同样是除那%和/的区别？
	//如果是除号，得到的结果是商
	int b = 5 / 2;
	printf("%d\n", b);//2

	//如果是取模，得到的是余数
	int a=5 % 2;
	printf("%d\n", a);//1
	return 0;
}

int main0202(void)
{
	//移位操作符 >>(右移)	 <<(左移)
	//移的是二进制位
	int a = 1;
	//00000000 00000000 00000000 00000001
	//就是把a的二进制序列整体向左移动一位，则左边的第1个0丢弃，右边补1个0
	//00000000 00000000 00000000 00000010
	int b=a << 1;
	
	//二进制10转换十进制2
	printf("%d\n", b);//2

	//当对a进行移动操作的时候，a本身是不变的；相当于b=a+1
	printf("%d\n", a);//1

	return 0;
}

int main0203(void)
{
	//(二进制)位操作符 &  ^  |

	//&按位  与			 同真为真，其余为假
	//|按位  或		     同假为假，其余为真
	//^按位	 异或
	
	int a = 3;
	int b = 5;
	int c=a&b;
	//在C语言中0为假，1为真；所有非0的值都是真值

	//3的二进制位011
	//5的二进制位101
	//			 001
	//	   十进制为1
	printf("%d\n", c);//1


	int d = 3;
	int e = 5;
	int f = d | e;
	//3的二进制位011
	//5的二进制位101
	//           111
	//     十进制为7
	printf("%d\n", f);//7


	int g = 3;
	int h = 5;
	int	i = g ^ h;//注意这里^不是次方，而是异或
	//异或的计算规律：对应的二进制位相同，则为0；对应的二进制位相异，则为1
	//3的二进制位011
	//5的二进制位101
	//           110
	//	   十进制为6
	printf("%d\n", i);//6
	return 0;
}

int main0204(void)
{
	//赋值操作符：=   +=   -=   *=   /=   &=   ^=   |=   >>=   <<=
	int a = 10;
	a = 20;//=赋值    ==判断相等

	//以下两种写法等价
	a = a + 10;
	a += 10;//这种叫做复合赋值符

	a=a&2;
	a &= 2;

	a = a >>= 2;
	a >>= 2;

	return 0;
}

int main(void)
{
	//单目操作符
	//双目操作符
	//三目操作符

	//int a = 10;
	//int b = 20;
	//a + b;//+是一个操作符；+左右各有一个操作数，所以又叫双目操作符 
	//故名思义，单目操作符只有一个操作数；三目操作符有三个操作数

	/*
	!	非；非真为假，非假为真
	-	负
	+	正
	&	取地址
	sizeof	
	~	对一个数的二进制按位取反
	++	前自增；后自增
	--	前自减；后自减
	*	间接访问操作符
	(类型）  强制类型转换
	*/

	//!
	int a = 10;
	//int a=0;
	printf("%d\n", a);
	printf("%d\n", !a);

	//sizeof计算的是变量/类型所占空间的大小，单位是字节
	//有三种写法
	printf("%d\n", sizeof(int));
	printf("%d\n", sizeof(a));
	printf("%d\n", sizeof a);


	//~ 按位取反(二进制位)
	int b = 0;
	int c = ~b;//c是有符号的整型

	//00000000 00000000 00000000 00000000
	//11111111 11111111 11111111 11111111
	//为什么是-1呢？？？
	//原码  反码  补码
	//负数在内存中存储的是二进制的补码
	//11111111 11111111 11111111 11111111(补码)
	//11111111 11111111 11111111 11111110(补码-1得到原码）
	//10000000 00000000 00000000 00000001(得到原码)
	//第1位是负，最后一位是1，所以是-1
	printf("%d\n", c);//-1(打印的是这个数的原码)


	//--    ++
	int d = 10;
	//int e = d++;//后自增；这里是先把d的值10赋值给e，然后d在自增(先使用，再++)
	int e = ++d;//前自增；这里是先自增，在使用
	printf("d=%d e=%d\n", d,e);//后自增：11  10   前自增：11 11
	//--同理
	
	
	//强制类型转换     double------int 
	int f=(int)3.14;

	return 0;
}
